In [2]:
pip install mysql.connector.python

In [38]:
#Import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [39]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection= mysql.connector.connect(
                 host = host_name,
                 user = user_name,
                 passwd = user_password
        )
        print ("MySQL Database connection successful")
    except Error as err:
        print(f"Error : '{err}'")
    return connection
        
#Put our MYSQL Terminal password
pw = "*************"
        
#Database name
    
db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [34]:
#Create mysql_python
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print (f"Error: '{err}'")
create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Database created successfully

In [40]:
#connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
           passwd = user_password,
           database = db_name)
        print("MySql database connection successful")
    except Error as err:
        print(f"Error : '{err}'")
    return connection

In [41]:
#Execute sql queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: '{err}'")

In [42]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
#connect to the database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySql database connection successful
Query was successful

In [48]:
#Insert data
data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, 80000, '8382929292'),
(102, 'Jos', 'Books', '2019-02-10', 12, 30, '6728389191'),
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8292922092'),
(104, 'Nancy', 'T-shirts', '2018-07-14', 30, 40, '6282929192'),
(105, 'Maria', 'Headphones', '2019-08-20', 10, 300, 8292020298),
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 7900, '9826373837'),
(107, 'Monica', 'Camera', '2019-10-19', 20, 2900, '8927263738'),
(108, 'Veronica', 'Pressure Cooker','2017-06-18', 12, 900, '27383939392'),
(109, 'Shirley', 'Smart phone', '2019-08-19', 10, 63, '7382829291'),
(110, 'Ama', 'Sound system', '2018-06-13', 12, 11, '93292738392');
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySql database connection successful
Query was successful

In [49]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [50]:
#using the select stmt
q1 = """
select *from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 80000.0, '8382929292')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 12, 30.0, '6728389191')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8292922092')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 30, 40.0, '6282929192')
(105, 'Maria', 'Headphones', datetime.date(2019, 8, 20), 10, 300.0, '8292020298')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 7900.0, '9826373837')
(107, 'Monica', 'Camera', datetime.date(2019, 10, 19), 20, 2900.0, '8927263738')
(108, 'Veronica', 'Pressure Cooker', datetime.date(2017, 6, 18), 12, 900.0, '27383939392')
(109, 'Shirley', 'Smart phone', datetime.date(2019, 8, 19), 10, 63.0, '7382829291')
(110, 'Ama', 'Sound system', datetime.date(2018, 6, 13), 12, 11.0, '93292738392')

In [51]:
q2 = """
select customer_name, phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySql database connection successful
('Steve', '8382929292')
('Jos', '6728389191')
('Stacy', '8292922092')
('Nancy', '6282929192')
('Maria', '8292020298')
('Danny', '9826373837')
('Monica', '8927263738')
('Veronica', '27383939392')
('Shirley', '7382829291')
('Ama', '93292738392')

In [52]:
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)
(2019,)
(2017,)
(2019,)
(2018,)

In [53]:
q4 = """
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)
(2017,)

In [54]:
q5 = """
select *from orders where date_ordered < '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 80000.0, '8382929292')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 30, 40.0, '6282929192')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 7900.0, '9826373837')
(108, 'Veronica', 'Pressure Cooker', datetime.date(2017, 6, 18), 12, 900.0, '27383939392')
(110, 'Ama', 'Sound system', datetime.date(2018, 6, 13), 12, 11.0, '93292738392')

In [55]:
q6 = """
select *from orders where date_ordered > '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySql database connection successful
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 12, 30.0, '6728389191')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8292922092')
(105, 'Maria', 'Headphones', datetime.date(2019, 8, 20), 10, 300.0, '8292020298')
(107, 'Monica', 'Camera', datetime.date(2019, 10, 19), 20, 2900.0, '8927263738')
(109, 'Shirley', 'Smart phone', datetime.date(2019, 8, 19), 10, 63.0, '7382829291')

In [56]:
q7 = """
select *from orders order by unit_price;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySql database connection successful
(110, 'Ama', 'Sound system', datetime.date(2018, 6, 13), 12, 11.0, '93292738392')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 12, 30.0, '6728389191')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 30, 40.0, '6282929192')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8292922092')
(109, 'Shirley', 'Smart phone', datetime.date(2019, 8, 19), 10, 63.0, '7382829291')
(105, 'Maria', 'Headphones', datetime.date(2019, 8, 20), 10, 300.0, '8292020298')
(108, 'Veronica', 'Pressure Cooker', datetime.date(2017, 6, 18), 12, 900.0, '27383939392')
(107, 'Monica', 'Camera', datetime.date(2019, 10, 19), 20, 2900.0, '8927263738')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 7900.0, '9826373837')
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 80000.0, '8382929292')

In [57]:
q8 = """
select *from orders order by unit_price desc;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 80000.0, '8382929292')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 7900.0, '9826373837')
(107, 'Monica', 'Camera', datetime.date(2019, 10, 19), 20, 2900.0, '8927263738')
(108, 'Veronica', 'Pressure Cooker', datetime.date(2017, 6, 18), 12, 900.0, '27383939392')
(105, 'Maria', 'Headphones', datetime.date(2019, 8, 20), 10, 300.0, '8292020298')
(109, 'Shirley', 'Smart phone', datetime.date(2019, 8, 19), 10, 63.0, '7382829291')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8292922092')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 30, 40.0, '6282929192')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 12, 30.0, '6728389191')
(110, 'Ama', 'Sound system', datetime.date(2018, 6, 13), 12, 11.0, '93292738392')

In [58]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", 
          "unit_price", "phone_number"]
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,80000.0,8382929292
1,106,Danny,Smart TV,2018-08-20,10,7900.0,9826373837
2,107,Monica,Camera,2019-10-19,20,2900.0,8927263738
3,108,Veronica,Pressure Cooker,2017-06-18,12,900.0,27383939392
4,105,Maria,Headphones,2019-08-20,10,300.0,8292020298
5,109,Shirley,Smart phone,2019-08-19,10,63.0,7382829291
6,103,Stacy,Trousers,2019-12-25,5,50.0,8292922092
7,104,Nancy,T-shirts,2018-07-14,30,40.0,6282929192
8,102,Jos,Books,2019-02-10,12,30.0,6728389191
9,110,Ama,Sound system,2018-06-13,12,11.0,93292738392

In [61]:
#Update a command
update = """
update orders
set unit_price = 45
where order_id = 103
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySql database connection successful
Query was successful

In [62]:
q8 = """
select *from orders where order_id = 103;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySql database connection successful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8292922092')

In [ ]:
#Delete command
delete_order ="""
delete from orders
where order_id = 105;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)